---
layout: page
title : About me
header : About me
group: navigation
---



基本信息
==========

<div>
	<img src="http://pic.yupoo.com/liuzhe0223/Co76LOoA/QC2zW.jpg" alt="liuzhe">
</div>

姓名：刘哲
年龄：22
mail：liuzhe0223@gmail.com
tel：18766966975
blog: liuzhe0223.github.io
github: github.com/liuzhe0223


教育经历
==========

老早--2010：在家乡菏泽上小学、初中、高中（努力考大学）

2010--现在：在山东理工大学上学，现在大三，计算机科学

我的技能
===========

英语
-----

    这个可以有，web.py、django...的文档都撑过来啦

linux
------

    大一暑假到现在的日常使用的系统(最喜欢的发行版是ARCHLINUX, 也是用的最长时间的linux发行版),并承担为教务处维护服务器的职责．

编程语言
----------

    `ｃ语言`，我的第一门编程语言，带我走进程序的世界(写acm时用，没有用来做应用).

    `python`我的第一门动态语言, 大一过后开始接触，经常用它写一些小东西,大学期间使用时间最长的语言．熟悉常用的库，和一些常用高级语法特性，web方面使用过 django,web.py, flask. 桌面gui接触过pysides．除了正是项目经常用它写一些小工具帮助完成老师交给的任务和处理抓取网上一些信息．

    `ruby`,也是一门不错的语言， 特别是rails框架写着超爽, 和学长一块写过个项目，现在深入学习中．

    有时间时看一看`golang`  

    java,oh yes,你没看错，我写过`java`,(只因我选修了计算机科学这门课, 你懂得）


web前端
--------

    能为自己的项目写页面, `html`,`css` 布局(最近较喜欢用`bootstrap`),简单的js交互(使用`jquery`,`coffee`),总体来说有待提高


科学上网的能力
----------------

    这个就不便公开说啦，你懂的

最重要的技能：自学能力（主要是因为老师逼得，我也希望有多个好老师来指点)，喜欢新技术，坚定的认为我猿类只有坚持学习才能进化．


其他
======

工具
------

    开发用：       vim, sublime text2,chrome, git（可帮我大忙啦）

    文件同步：　云诺，dropbox

    网页剪辑：　麦库，evernote

    小组合作：　tower, trello

    实时沟通：    gtalk

    文本标记：　markdown

玩具
-----

    树莓派，做个小的web服务器不错．我看好，希望以后的项目中可以用它发挥大作用．



线上出没于
------------

    slug, oschina, ruby-china, python-china, cpyug, stackoverflow, 知乎，豆瓣

使用过的 cloud
------------------

    heroku,appfog,openshift,gae  (前面排名不分先后）

    sae, 阿里云

运动
------

    乒乓球（运动视频，后面就是我们中心的服务器机房）．


实践经历
============

从大一暑假到现在一直在山东理工大学教育技术中心技术岗,工作是维护我校教务处服务器及其上的网站,并应老师需求写一些网站,其余大部分时间自己学习感兴趣的技术,我们称自己为技术中心小组,我们一直相信短小而精悍的团队能带来更高的效率.大多数服务器是linux系统, 我们小组也就已linux为主题,每个人的技术方向也都建立在linux上,加入小组我遇到的遇到的志同道合的朋友和师傅,定期的技术分享让我们共同提高。同时也和学长一起开始组建山东理工大学linux用户组

因为在学校的"卓越工程师班"(只是个名字,你懂得),所以每学期一些课程的课程设计在一些软件公司完成



项目经验
===========


    学校的教务处网站（和学长一起写的，ruby on rails 的, mysql)，代码

    会员消费管理系统，使用 python, web.py,sqlite 代码

    成果展示网站， 使用 ruby on rails 与mysql 代码 

    小组的图书自由借阅平台， 使用python，web.py，mongodb 代码

    社团相关会员管理及发布平台，使用 python, flask, sqlite 代码

    ......


我想说
======

现在大三，希望能从暑假开始找到一个实习，自己在学校虽然自学了一些东西，但还是想离实际需求近一点。其实有个有经验的人点一下， 哎，灵机一动（被某本书带的）。
